// Generated by jextract

package gov.nasa.gsfc.heasarc.cfitsio;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class FITSfile {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_LONG$LAYOUT.withName("filehandle"),
        Constants$root.C_LONG$LAYOUT.withName("driver"),
        Constants$root.C_LONG$LAYOUT.withName("open_count"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("filename"),
        Constants$root.C_LONG$LAYOUT.withName("validcode"),
        Constants$root.C_LONG$LAYOUT.withName("only_one"),
        Constants$root.C_LONG$LAYOUT.withName("noextsyntax"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("filesize"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("logfilesize"),
        Constants$root.C_LONG$LAYOUT.withName("lasthdu"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("bytepos"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("io_pos"),
        Constants$root.C_LONG$LAYOUT.withName("curbuf"),
        Constants$root.C_LONG$LAYOUT.withName("curhdu"),
        Constants$root.C_LONG$LAYOUT.withName("hdutype"),
        Constants$root.C_LONG$LAYOUT.withName("writemode"),
        Constants$root.C_LONG$LAYOUT.withName("maxhdu"),
        Constants$root.C_LONG$LAYOUT.withName("MAXHDU"),
        Constants$root.C_POINTER$LAYOUT.withName("headstart"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("headend"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("ENDpos"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("nextkey"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("datastart"),
        Constants$root.C_LONG$LAYOUT.withName("imgdim"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.sequenceLayout(99, Constants$root.C_LONG_LONG$LAYOUT).withName("imgnaxis"),
        Constants$root.C_LONG$LAYOUT.withName("tfield"),
        Constants$root.C_LONG$LAYOUT.withName("startcol"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("origrows"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("numrows"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("rowlength"),
        Constants$root.C_POINTER$LAYOUT.withName("tableptr"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("heapstart"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("heapsize"),
        Constants$root.C_LONG$LAYOUT.withName("request_compress_type"),
        MemoryLayout.sequenceLayout(6, Constants$root.C_LONG$LAYOUT).withName("request_tilesize"),
        Constants$root.C_FLOAT$LAYOUT.withName("request_quantize_level"),
        Constants$root.C_LONG$LAYOUT.withName("request_quantize_method"),
        Constants$root.C_LONG$LAYOUT.withName("request_dither_seed"),
        Constants$root.C_LONG$LAYOUT.withName("request_lossy_int_compress"),
        Constants$root.C_LONG$LAYOUT.withName("request_huge_hdu"),
        Constants$root.C_FLOAT$LAYOUT.withName("request_hcomp_scale"),
        Constants$root.C_LONG$LAYOUT.withName("request_hcomp_smooth"),
        Constants$root.C_LONG$LAYOUT.withName("compress_type"),
        MemoryLayout.sequenceLayout(6, Constants$root.C_LONG$LAYOUT).withName("tilesize"),
        Constants$root.C_FLOAT$LAYOUT.withName("quantize_level"),
        Constants$root.C_LONG$LAYOUT.withName("quantize_method"),
        Constants$root.C_LONG$LAYOUT.withName("dither_seed"),
        Constants$root.C_LONG$LAYOUT.withName("compressimg"),
        MemoryLayout.sequenceLayout(12, Constants$root.C_CHAR$LAYOUT).withName("zcmptype"),
        Constants$root.C_LONG$LAYOUT.withName("zbitpix"),
        Constants$root.C_LONG$LAYOUT.withName("zndim"),
        MemoryLayout.sequenceLayout(6, Constants$root.C_LONG$LAYOUT).withName("znaxis"),
        Constants$root.C_LONG$LAYOUT.withName("maxtilelen"),
        Constants$root.C_LONG$LAYOUT.withName("maxelem"),
        Constants$root.C_LONG$LAYOUT.withName("cn_compressed"),
        Constants$root.C_LONG$LAYOUT.withName("cn_uncompressed"),
        Constants$root.C_LONG$LAYOUT.withName("cn_gzip_data"),
        Constants$root.C_LONG$LAYOUT.withName("cn_zscale"),
        Constants$root.C_LONG$LAYOUT.withName("cn_zzero"),
        Constants$root.C_LONG$LAYOUT.withName("cn_zblank"),
        Constants$root.C_DOUBLE$LAYOUT.withName("zscale"),
        Constants$root.C_DOUBLE$LAYOUT.withName("zzero"),
        Constants$root.C_DOUBLE$LAYOUT.withName("cn_bscale"),
        Constants$root.C_DOUBLE$LAYOUT.withName("cn_bzero"),
        Constants$root.C_DOUBLE$LAYOUT.withName("cn_actual_bzero"),
        Constants$root.C_LONG$LAYOUT.withName("zblank"),
        Constants$root.C_LONG$LAYOUT.withName("rice_blocksize"),
        Constants$root.C_LONG$LAYOUT.withName("rice_bytepix"),
        Constants$root.C_FLOAT$LAYOUT.withName("hcomp_scale"),
        Constants$root.C_LONG$LAYOUT.withName("hcomp_smooth"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("tilerow"),
        Constants$root.C_POINTER$LAYOUT.withName("tiledatasize"),
        Constants$root.C_POINTER$LAYOUT.withName("tiletype"),
        Constants$root.C_POINTER$LAYOUT.withName("tiledata"),
        Constants$root.C_POINTER$LAYOUT.withName("tilenullarray"),
        Constants$root.C_POINTER$LAYOUT.withName("tileanynull"),
        Constants$root.C_POINTER$LAYOUT.withName("iobuffer"),
        MemoryLayout.sequenceLayout(40, Constants$root.C_LONG$LAYOUT).withName("bufrecnum"),
        MemoryLayout.sequenceLayout(40, Constants$root.C_LONG$LAYOUT).withName("dirty"),
        MemoryLayout.sequenceLayout(40, Constants$root.C_LONG$LAYOUT).withName("ageindex")
    );
    public static MemoryLayout $LAYOUT() {
        return FITSfile.$struct$LAYOUT;
    }
    static final VarHandle filehandle$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("filehandle"));
